# Real-world Data Wrangling

In this project, you will apply the skills you acquired in the course to gather and wrangle real-world data with two datasets of your choice.

You will retrieve and extract the data, assess the data programmatically and visually, accross elements of data quality and structure, and implement a cleaning strategy for the data. You will then store the updated data into your selected database/data store, combine the data, and answer a research question with the datasets.

Throughout the process, you are expected to:

1. Explain your decisions towards methods used for gathering, assessing, cleaning, storing, and answering the research question
2. Write code comments so your code is more readable

## 1. Gather data

In this section, you will extract data using two different data gathering methods and combine the data. Use at least two different types of data-gathering methods.

### **1.1.** Problem Statement
In 2-4 sentences, explain the kind of problem you want to look at and the datasets you will be wrangling for this project.

*FILL IN:*

### **1.2.** Gather at least two datasets using two different data gathering methods

List of data gathering methods:

- Download data manually
- Programmatically downloading files
- Gather data by accessing APIs
- Gather and extract data from HTML files using BeautifulSoup
- Extract data from a SQL database

Each dataset must have at least two variables, and have greater than 500 data samples within each dataset.

For each dataset, briefly describe why you picked the dataset and the gathering method (2-3 full sentences), including the names and significance of the variables in the dataset. Show your work (e.g., if using an API to download the data, please include a snippet of your code). 

Load the dataset programmtically into this notebook.

#### **Dataset 1**

Type: *FILL IN* (e.g., CSV File.)

Method: *FILL IN* (e.g., The data was gathered using the "Downloading files" method from X source.)

Dataset variables:

*   *Variable 1 FILL IN* (e.g., H_MEAN: Mean hourly wage)
*   *Variable 2 FILL IN*

In [501]:
# imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [502]:
#FILL IN 1st data gathering and loading method

############################## First DataSet #########################################
# Seoul Weather Data load from url
# url return a zip file containing csv files

import requests as req
import zipfile as zf
from io import BytesIO 

url =  'https://www.kaggle.com/api/v1/datasets/download/alfredkondoro/seoul-historical-weather-data-2024'
response = req.get(url)

with zf.ZipFile(BytesIO(response.content)) as z:
    file_list = z.namelist()
   # print('files in zip =', file_list )

    csv_files = [ f  for f in file_list if f.endswith('.csv') ]

    count=len(csv_files)
    dfw = pd.DataFrame()
    i=0;
    
    while count > 0 :
        count= count -1
        if csv_files:
            with z.open(csv_files[i]) as f:
                temp_df = pd.read_csv(f)
                dfw = pd.concat([dfw , temp_df] , ignore_index = True)
                i =i+1
        else:
            print("No CSV files found.")

In [503]:
dfw.head(5)

,name,datetime,tempmax,tempmin,temp,feelslikemax,feelslikemin,feelslike,dew,humidity,...,solarenergy,uvindex,severerisk,sunrise,sunset,moonphase,conditions,description,icon,stations
0,seoul,1994-01-01,35.2,16.4,26.3,33.4,13.0,24.3,15.5,65.9,...,NaN,NaN,NaN,1994-01-01T07:46:54,1994-01-01T17:23:56,0.61,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
1,seoul,1994-01-02,43.0,31.5,36.2,39.4,26.7,32.6,27.9,72.1,...,NaN,NaN,NaN,1994-01-02T07:47:03,1994-01-02T17:24:44,0.65,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
2,seoul,1994-01-03,47.9,30.9,38.0,44.7,24.5,35.4,27.3,68.1,...,NaN,NaN,NaN,1994-01-03T07:47:11,1994-01-03T17:25:33,0.68,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
3,seoul,1994-01-04,38.8,22.1,30.1,32.0,18.4,26.3,13.6,51.2,...,NaN,NaN,NaN,1994-01-04T07:47:16,1994-01-04T17:26:23,0.72,Clear,Clear conditions throughout the day.,clear-day,"47111099999,47112099999,47120099999,4711009999..."
4,seoul,1994-01-05,40.0,24.0,33.1,40.0,18.5,31.0,21.7,63.9,...,NaN,NaN,NaN,1994-01-05T07:47:19,1994-01-05T17:27:14,0.75,"Snow, Rain, Overcast",Cloudy skies throughout the day with late afte...,rain,"47111099999,47112099999,47120099999,4711009999..."

In [504]:
dfw.sort_values(by='datetime', ascending= False).head(5)

,name,datetime,tempmax,tempmin,temp,feelslikemax,feelslikemin,feelslike,dew,humidity,...,solarenergy,uvindex,severerisk,sunrise,sunset,moonphase,conditions,description,icon,stations
10971,seoul,2024-01-01,7.3,-0.2,3.0,6.6,-2.8,1.7,0.5,84.7,...,8.6,5.0,10.0,2024-01-01T07:46:50,2024-01-01T17:23:42,0.66,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47098099999,47112099999,4711909999..."
10970,seoul,2023-12-31,4.4,0.8,2.3,3.1,-1.8,0.4,1.5,94.7,...,4.5,4.0,10.0,2023-12-31T07:46:38,2023-12-31T17:22:57,0.63,"Snow, Rain, Partially cloudy",Partly cloudy throughout the day with a chance...,rain,"47111099999,47098099999,47112099999,4711909999..."
10969,seoul,2023-12-30,1.9,-0.9,0.5,-1.2,-3.5,-2.4,-1.0,90.1,...,1.8,1.0,10.0,2023-12-30T07:46:24,2023-12-30T17:22:12,0.60,"Snow, Rain, Partially cloudy",Partly cloudy throughout the day with rain or ...,snow,"47111099999,47098099999,47112099999,4711909999..."
10968,seoul,2023-12-29,4.5,-1.4,1.5,3.0,-3.5,-0.1,-3.3,70.2,...,8.8,4.0,10.0,2023-12-29T07:46:08,2023-12-29T17:21:29,0.57,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47098099999,47112099999,4711909999..."
10967,seoul,2023-12-28,4.1,-1.7,1.1,2.4,-3.4,0.0,-3.7,71.5,...,9.6,5.0,10.0,2023-12-28T07:45:50,2023-12-28T17:20:48,0.54,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47098099999,47112099999,4711909999..."

#### Dataset 2

Type: *FILL IN* (e.g., CSV File.)

Method: *FILL IN* (e.g., The data was gathered using the "API" method from Y source.)

Dataset variables:

*   *Variable 1 FILL IN* (e.g., H_MEAN: Mean hourly wage)
*   *Variable 2 FILL IN*

In [505]:
#FILL IN 2nd data gathering and loading method


############################### Second Dataset ######################
### Air Pollution Dataset

dfp = pd.read_csv('seoul_air_1988_2021.csv')
dfp.head(5)

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
0,1988010100,103,37.540037,127.002661,NaN,0.007,10.3,0.000,NaN,NaN
1,1988010100,105,37.593730,126.947561,0.340,0.055,12.6,0.043,NaN,NaN
2,1988010100,107,37.542043,127.047497,0.399,0.046,13.4,NaN,NaN,NaN
3,1988010100,108,37.547185,127.090304,0.261,0.034,5.4,0.000,NaN,NaN
4,1988010100,113,37.654140,127.026801,0.443,0.039,14.6,0.000,NaN,NaN

Optional data storing step: You may save your raw dataset files to the local data store before moving to the next step.

In [506]:
#Optional: store the raw data in your local data store

## 2. Assess data

Assess the data according to data quality and tidiness metrics using the report below.

List **two** data quality issues and **two** tidiness issues. Assess each data issue visually **and** programmatically, then briefly describe the issue you find.  **Make sure you include justifications for the methods you use for the assessment.**

### Quality Issue 1:

In [507]:
#FILL IN - Inspecting the dataframe visually

# Weather Dataset
# you can see the columns have missing values after the execution of above command

dfw.head(5)

,name,datetime,tempmax,tempmin,temp,feelslikemax,feelslikemin,feelslike,dew,humidity,...,solarenergy,uvindex,severerisk,sunrise,sunset,moonphase,conditions,description,icon,stations
0,seoul,1994-01-01,35.2,16.4,26.3,33.4,13.0,24.3,15.5,65.9,...,NaN,NaN,NaN,1994-01-01T07:46:54,1994-01-01T17:23:56,0.61,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
1,seoul,1994-01-02,43.0,31.5,36.2,39.4,26.7,32.6,27.9,72.1,...,NaN,NaN,NaN,1994-01-02T07:47:03,1994-01-02T17:24:44,0.65,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
2,seoul,1994-01-03,47.9,30.9,38.0,44.7,24.5,35.4,27.3,68.1,...,NaN,NaN,NaN,1994-01-03T07:47:11,1994-01-03T17:25:33,0.68,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
3,seoul,1994-01-04,38.8,22.1,30.1,32.0,18.4,26.3,13.6,51.2,...,NaN,NaN,NaN,1994-01-04T07:47:16,1994-01-04T17:26:23,0.72,Clear,Clear conditions throughout the day.,clear-day,"47111099999,47112099999,47120099999,4711009999..."
4,seoul,1994-01-05,40.0,24.0,33.1,40.0,18.5,31.0,21.7,63.9,...,NaN,NaN,NaN,1994-01-05T07:47:19,1994-01-05T17:27:14,0.75,"Snow, Rain, Overcast",Cloudy skies throughout the day with late afte...,rain,"47111099999,47112099999,47120099999,4711009999..."

In [508]:
#FILL IN - Inspecting the dataframe programmatically
# After executing the following command. you will see the total number of null values in each column

dfw.isnull().sum()

name                    0
datetime                0
tempmax                 0
tempmin                 0
temp                    0
feelslikemax            0
feelslikemin            0
feelslike               0
dew                     0
humidity                0
precip                  0
precipprob              0
precipcover             0
preciptype           6923
snow                 2926
snowdepth            2717
windgust             7325
windspeed               0
winddir                 0
sealevelpressure        0
cloudcover              0
visibility              0
solarradiation       5851
solarenergy          5851
uvindex              5851
severerisk          10250
sunrise                 0
sunset                  0
moonphase               0
conditions              0
description             0
icon                    0
stations                0
dtype: int64

Issue and justification: *FILL IN*

### Quality Issue 2:

In [509]:
#FILL IN - Inspecting the dataframe visually
# dupilcate values

dfw[
    (dfw['tempmax'].round(1) == 35.2) & 
    (dfw['tempmin'].round(1) == 16.4) & 
    (dfw['temp'].round(1) == 26.3)
]

,name,datetime,tempmax,tempmin,temp,feelslikemax,feelslikemin,feelslike,dew,humidity,...,solarenergy,uvindex,severerisk,sunrise,sunset,moonphase,conditions,description,icon,stations
0,seoul,1994-01-01,35.2,16.4,26.3,33.4,13.0,24.3,15.5,65.9,...,NaN,NaN,NaN,1994-01-01T07:46:54,1994-01-01T17:23:56,0.61,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."

In [510]:
#FILL IN - Inspecting the dataframe programmatically

dfw.duplicated().sum()

3

Issue and justification: *FILL IN*

### Tidiness Issue 1:

In [511]:
#FILL IN - Inspecting the dataframe visually
# After the execution 
# you can see the multiple values stored  are stored in one column name station

dfw.head(5)

,name,datetime,tempmax,tempmin,temp,feelslikemax,feelslikemin,feelslike,dew,humidity,...,solarenergy,uvindex,severerisk,sunrise,sunset,moonphase,conditions,description,icon,stations
0,seoul,1994-01-01,35.2,16.4,26.3,33.4,13.0,24.3,15.5,65.9,...,NaN,NaN,NaN,1994-01-01T07:46:54,1994-01-01T17:23:56,0.61,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
1,seoul,1994-01-02,43.0,31.5,36.2,39.4,26.7,32.6,27.9,72.1,...,NaN,NaN,NaN,1994-01-02T07:47:03,1994-01-02T17:24:44,0.65,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
2,seoul,1994-01-03,47.9,30.9,38.0,44.7,24.5,35.4,27.3,68.1,...,NaN,NaN,NaN,1994-01-03T07:47:11,1994-01-03T17:25:33,0.68,Partially cloudy,Partly cloudy throughout the day.,partly-cloudy-day,"47111099999,47112099999,47120099999,4711009999..."
3,seoul,1994-01-04,38.8,22.1,30.1,32.0,18.4,26.3,13.6,51.2,...,NaN,NaN,NaN,1994-01-04T07:47:16,1994-01-04T17:26:23,0.72,Clear,Clear conditions throughout the day.,clear-day,"47111099999,47112099999,47120099999,4711009999..."
4,seoul,1994-01-05,40.0,24.0,33.1,40.0,18.5,31.0,21.7,63.9,...,NaN,NaN,NaN,1994-01-05T07:47:19,1994-01-05T17:27:14,0.75,"Snow, Rain, Overcast",Cloudy skies throughout the day with late afte...,rain,"47111099999,47112099999,47120099999,4711009999..."

In [512]:
#FILL IN - Inspecting the dataframe programmatically
dfw['stations']

0        47111099999,47112099999,47120099999,4711009999...
1        47111099999,47112099999,47120099999,4711009999...
2        47111099999,47112099999,47120099999,4711009999...
3        47111099999,47112099999,47120099999,4711009999...
4        47111099999,47112099999,47120099999,4711009999...
                               ...
10967    47111099999,47098099999,47112099999,4711909999...
10968    47111099999,47098099999,47112099999,4711909999...
10969    47111099999,47098099999,47112099999,4711909999...
10970    47111099999,47098099999,47112099999,4711909999...
10971    47111099999,47098099999,47112099999,4711909999...
Name: stations, Length: 10972, dtype: object

Issue and justification: *FILL IN*

### Tidiness Issue 2:

In [513]:
#FILL IN - Inspecting the dataframe visually
# After the execution of  command , you will see the datatype of the columns are object instead of datatime

dfw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10972 entries, 0 to 10971
Data columns (total 33 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10972 non-null  object
 1   datetime          10972 non-null  object
 2   tempmax           10972 non-null  float64
 3   tempmin           10972 non-null  float64
 4   temp              10972 non-null  float64
 5   feelslikemax      10972 non-null  float64
 6   feelslikemin      10972 non-null  float64
 7   feelslike         10972 non-null  float64
 8   dew               10972 non-null  float64
 9   humidity          10972 non-null  float64
 10  precip            10972 non-null  float64
 11  precipprob        10972 non-null  int64
 12  precipcover       10972 non-null  float64
 13  preciptype        4049 non-null   object
 14  snow              8046 non-null   float64
 15  snowdepth         8255 non-null   float64
 16  windgust          3647 non-null   float64
 17  windspeed         10972 non-null  float64
 18  winddir           10972 non-null  float64
 19  sealevelpressure  10972 non-null  float64
 20  cloudcover        10972 non-null  float64
 21  visibility        10972 non-null  float64
 22  solarradiation    5121 non-null   float64
 23  solarenergy       5121 non-null   float64
 24  uvindex           5121 non-null   float64
 25  severerisk        722 non-null    float64
 26  sunrise           10972 non-null  object
 27  sunset            10972 non-null  object
 28  moonphase         10972 non-null  float64
 29  conditions        10972 non-null  object
 30  description       10972 non-null  object
 31  icon              10972 non-null  object
 32  stations          10972 non-null  object
dtypes: float64(23), int64(1), object(9)
memory usage: 2.8+ MB

In [514]:
#FILL IN - Inspecting the dataframe programmatically

print(dfw['sunrise'].dtype)
print(dfw['sunset'].dtype)
print(dfw['datetime'].dtype)

# After the execution of above command , you will see the datatype of the columns are object instead of datatime

object
object
object

Issue and justification: *FILL IN*

## 3. Clean data
Clean the data to solve the 4 issues corresponding to data quality and tidiness found in the assessing step. **Make sure you include justifications for your cleaning decisions.**

After the cleaning for each issue, please use **either** the visually or programatical method to validate the cleaning was succesful.

At this stage, you are also expected to remove variables that are unnecessary for your analysis and combine your datasets. Depending on your datasets, you may choose to perform variable combination and elimination before or after the cleaning stage. Your dataset must have **at least** 4 variables after combining the data.

In [515]:
# FILL IN - Make copies of the datasets to ensure the raw dataframes 
# are not impacted

dfwc = dfw
dfwc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10972 entries, 0 to 10971
Data columns (total 33 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10972 non-null  object
 1   datetime          10972 non-null  object
 2   tempmax           10972 non-null  float64
 3   tempmin           10972 non-null  float64
 4   temp              10972 non-null  float64
 5   feelslikemax      10972 non-null  float64
 6   feelslikemin      10972 non-null  float64
 7   feelslike         10972 non-null  float64
 8   dew               10972 non-null  float64
 9   humidity          10972 non-null  float64
 10  precip            10972 non-null  float64
 11  precipprob        10972 non-null  int64
 12  precipcover       10972 non-null  float64
 13  preciptype        4049 non-null   object
 14  snow              8046 non-null   float64
 15  snowdepth         8255 non-null   float64
 16  windgust          3647 non-null   float64
 17  windspeed         10972 non-null  float64
 18  winddir           10972 non-null  float64
 19  sealevelpressure  10972 non-null  float64
 20  cloudcover        10972 non-null  float64
 21  visibility        10972 non-null  float64
 22  solarradiation    5121 non-null   float64
 23  solarenergy       5121 non-null   float64
 24  uvindex           5121 non-null   float64
 25  severerisk        722 non-null    float64
 26  sunrise           10972 non-null  object
 27  sunset            10972 non-null  object
 28  moonphase         10972 non-null  float64
 29  conditions        10972 non-null  object
 30  description       10972 non-null  object
 31  icon              10972 non-null  object
 32  stations          10972 non-null  object
dtypes: float64(23), int64(1), object(9)
memory usage: 2.8+ MB

### **Quality Issue 1: FILL IN**

In [516]:
# FILL IN - Apply the cleaning strategy
# no need of following variables/columns  for analysis
# Also the you can see the null values count

# column name        null values count
# preciptype           7395
# snow                10965
# snowdepth           10665
# windgust            10965
# solarradiation      10965
# solarenergy         10965
# uvindex             10965
# severerisk          10965



dfwc.drop(['preciptype', 'snow' , 'snowdepth', 'windgust', 'solarradiation', 'solarenergy', 'uvindex' , 'severerisk' ] , axis=1 , inplace=True )
dfwc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10972 entries, 0 to 10971
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10972 non-null  object
 1   datetime          10972 non-null  object
 2   tempmax           10972 non-null  float64
 3   tempmin           10972 non-null  float64
 4   temp              10972 non-null  float64
 5   feelslikemax      10972 non-null  float64
 6   feelslikemin      10972 non-null  float64
 7   feelslike         10972 non-null  float64
 8   dew               10972 non-null  float64
 9   humidity          10972 non-null  float64
 10  precip            10972 non-null  float64
 11  precipprob        10972 non-null  int64
 12  precipcover       10972 non-null  float64
 13  windspeed         10972 non-null  float64
 14  winddir           10972 non-null  float64
 15  sealevelpressure  10972 non-null  float64
 16  cloudcover        10972 non-null  float64
 17  visibility        10972 non-null  float64
 18  sunrise           10972 non-null  object
 19  sunset            10972 non-null  object
 20  moonphase         10972 non-null  float64
 21  conditions        10972 non-null  object
 22  description       10972 non-null  object
 23  icon              10972 non-null  object
 24  stations          10972 non-null  object
dtypes: float64(16), int64(1), object(8)
memory usage: 2.1+ MB

In [517]:
# FILL IN - Validate the cleaning was successful
# now there is no missing values
dfwc.isna().sum()

name                0
datetime            0
tempmax             0
tempmin             0
temp                0
feelslikemax        0
feelslikemin        0
feelslike           0
dew                 0
humidity            0
precip              0
precipprob          0
precipcover         0
windspeed           0
winddir             0
sealevelpressure    0
cloudcover          0
visibility          0
sunrise             0
sunset              0
moonphase           0
conditions          0
description         0
icon                0
stations            0
dtype: int64

Justification: *FILL IN*

### **Quality Issue 2: FILL IN**

In [518]:
#FILL IN - Apply the cleaning strategy
#  After the execution of following command , you can see the total number of duplicates

dfwc.drop_duplicates(inplace=True)
dfwc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10968 entries, 0 to 10971
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10968 non-null  object
 1   datetime          10968 non-null  object
 2   tempmax           10968 non-null  float64
 3   tempmin           10968 non-null  float64
 4   temp              10968 non-null  float64
 5   feelslikemax      10968 non-null  float64
 6   feelslikemin      10968 non-null  float64
 7   feelslike         10968 non-null  float64
 8   dew               10968 non-null  float64
 9   humidity          10968 non-null  float64
 10  precip            10968 non-null  float64
 11  precipprob        10968 non-null  int64
 12  precipcover       10968 non-null  float64
 13  windspeed         10968 non-null  float64
 14  winddir           10968 non-null  float64
 15  sealevelpressure  10968 non-null  float64
 16  cloudcover        10968 non-null  float64
 17  visibility        10968 non-null  float64
 18  sunrise           10968 non-null  object
 19  sunset            10968 non-null  object
 20  moonphase         10968 non-null  float64
 21  conditions        10968 non-null  object
 22  description       10968 non-null  object
 23  icon              10968 non-null  object
 24  stations          10968 non-null  object
dtypes: float64(16), int64(1), object(8)
memory usage: 2.2+ MB

In [519]:
#FILL IN - Validate the cleaning was successful


dfwc.duplicated().sum()

0

Justification: *FILL IN*

### **Tidiness Issue 1: FILL IN**

In [520]:
#FILL IN - Apply the cleaning strategy

dfwc.drop('stations' , axis=1 , inplace=True)

In [521]:
#FILL IN - Validate the cleaning was successful
# no need of the following column


dfwc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10968 entries, 0 to 10971
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10968 non-null  object
 1   datetime          10968 non-null  object
 2   tempmax           10968 non-null  float64
 3   tempmin           10968 non-null  float64
 4   temp              10968 non-null  float64
 5   feelslikemax      10968 non-null  float64
 6   feelslikemin      10968 non-null  float64
 7   feelslike         10968 non-null  float64
 8   dew               10968 non-null  float64
 9   humidity          10968 non-null  float64
 10  precip            10968 non-null  float64
 11  precipprob        10968 non-null  int64
 12  precipcover       10968 non-null  float64
 13  windspeed         10968 non-null  float64
 14  winddir           10968 non-null  float64
 15  sealevelpressure  10968 non-null  float64
 16  cloudcover        10968 non-null  float64
 17  visibility        10968 non-null  float64
 18  sunrise           10968 non-null  object
 19  sunset            10968 non-null  object
 20  moonphase         10968 non-null  float64
 21  conditions        10968 non-null  object
 22  description       10968 non-null  object
 23  icon              10968 non-null  object
dtypes: float64(16), int64(1), object(7)
memory usage: 2.1+ MB

Justification: *FILL IN*

### **Tidiness Issue 2: FILL IN**

In [522]:
#FILL IN - Apply the cleaning strategy

dfwc['sunrise'] = pd.to_datetime(dfwc['sunrise']) ;
dfwc['sunset'] = pd.to_datetime(dfwc['sunset']) ;
dfwc['datetime'] = pd.to_datetime(dfwc['datetime']) ;

In [523]:
#FILL IN - Validate the cleaning was successful
# changing the data type 


print(dfwc['sunrise'].dtype)
print(dfwc['sunset'].dtype)
print(dfwc['datetime'].dtype)

datetime64[ns]
datetime64[ns]
datetime64[ns]

In [524]:
dfwc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10968 entries, 0 to 10971
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10968 non-null  object
 1   datetime          10968 non-null  datetime64[ns]
 2   tempmax           10968 non-null  float64
 3   tempmin           10968 non-null  float64
 4   temp              10968 non-null  float64
 5   feelslikemax      10968 non-null  float64
 6   feelslikemin      10968 non-null  float64
 7   feelslike         10968 non-null  float64
 8   dew               10968 non-null  float64
 9   humidity          10968 non-null  float64
 10  precip            10968 non-null  float64
 11  precipprob        10968 non-null  int64
 12  precipcover       10968 non-null  float64
 13  windspeed         10968 non-null  float64
 14  winddir           10968 non-null  float64
 15  sealevelpressure  10968 non-null  float64
 16  cloudcover        10968 non-null  float64
 17  visibility        10968 non-null  float64
 18  sunrise           10968 non-null  datetime64[ns]
 19  sunset            10968 non-null  datetime64[ns]
 20  moonphase         10968 non-null  float64
 21  conditions        10968 non-null  object
 22  description       10968 non-null  object
 23  icon              10968 non-null  object
dtypes: datetime64[ns](3), float64(16), int64(1), object(4)
memory usage: 2.1+ MB

Justification: *FILL IN*

### **Dataset 2 - Air Polution**
resolve cleaning and tideness issues

In [525]:
# show only 5 rows 

dfpc= dfp
dfpc.head(5)

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
0,1988010100,103,37.540037,127.002661,NaN,0.007,10.3,0.000,NaN,NaN
1,1988010100,105,37.593730,126.947561,0.340,0.055,12.6,0.043,NaN,NaN
2,1988010100,107,37.542043,127.047497,0.399,0.046,13.4,NaN,NaN,NaN
3,1988010100,108,37.547185,127.090304,0.261,0.034,5.4,0.000,NaN,NaN
4,1988010100,113,37.654140,127.026801,0.443,0.039,14.6,0.000,NaN,NaN

In [526]:
dfpc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5984782 entries, 0 to 5984781
Data columns (total 10 columns):
 #   Column  Dtype
---  ------  -----
 0   dt      int64
 1   loc     int64
 2   lat     float64
 3   long    float64
 4   so2     float64
 5   no2     float64
 6   co      float64
 7   o3      float64
 8   pm10    float64
 9   pm2.5   float64
dtypes: float64(8), int64(2)
memory usage: 456.6 MB

In [527]:
dfpc.isna().sum()

dt             0
loc            0
lat            0
long           0
so2       117565
no2       128616
co        161948
o3        108206
pm10      947434
pm2.5    2228730
dtype: int64

In [528]:
# Removing last two digit in date column because we don't need them
dfpc['dt'] =dfpc['dt'].astype(str).str[:8]
dfpc

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
0,19880101,103,37.540037,127.002661,NaN,0.007,10.3,0.000,NaN,NaN
1,19880101,105,37.593730,126.947561,0.340,0.055,12.6,0.043,NaN,NaN
2,19880101,107,37.542043,127.047497,0.399,0.046,13.4,NaN,NaN,NaN
3,19880101,108,37.547185,127.090304,0.261,0.034,5.4,0.000,NaN,NaN
4,19880101,113,37.654140,127.026801,0.443,0.039,14.6,0.000,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
5984777,20211231,121,37.487359,126.924913,0.003,0.027,0.5,0.016,21.0,9.0
5984778,20211231,122,37.504547,126.992308,0.003,0.021,0.4,0.023,16.0,10.0
5984779,20211231,123,37.517546,127.045775,0.003,0.019,0.4,0.024,18.0,6.0
5984780,20211231,124,37.502688,127.090327,0.003,0.025,0.5,0.020,21.0,8.0
5984781,20211231,125,37.544989,127.134599,0.002,0.020,0.4,0.020,22.0,10.0

In [529]:
# converting to datetime

dfpc['dt'] =pd.to_datetime(dfpc['dt'])

In [530]:
dfpc

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
0,1988-01-01,103,37.540037,127.002661,NaN,0.007,10.3,0.000,NaN,NaN
1,1988-01-01,105,37.593730,126.947561,0.340,0.055,12.6,0.043,NaN,NaN
2,1988-01-01,107,37.542043,127.047497,0.399,0.046,13.4,NaN,NaN,NaN
3,1988-01-01,108,37.547185,127.090304,0.261,0.034,5.4,0.000,NaN,NaN
4,1988-01-01,113,37.654140,127.026801,0.443,0.039,14.6,0.000,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
5984777,2021-12-31,121,37.487359,126.924913,0.003,0.027,0.5,0.016,21.0,9.0
5984778,2021-12-31,122,37.504547,126.992308,0.003,0.021,0.4,0.023,16.0,10.0
5984779,2021-12-31,123,37.517546,127.045775,0.003,0.019,0.4,0.024,18.0,6.0
5984780,2021-12-31,124,37.502688,127.090327,0.003,0.025,0.5,0.020,21.0,8.0
5984781,2021-12-31,125,37.544989,127.134599,0.002,0.020,0.4,0.020,22.0,10.0

In [531]:
dfpc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5984782 entries, 0 to 5984781
Data columns (total 10 columns):
 #   Column  Dtype
---  ------  -----
 0   dt      datetime64[ns]
 1   loc     int64
 2   lat     float64
 3   long    float64
 4   so2     float64
 5   no2     float64
 6   co      float64
 7   o3      float64
 8   pm10    float64
 9   pm2.5   float64
dtypes: datetime64[ns](1), float64(8), int64(1)
memory usage: 456.6 MB

In [532]:
dfpc.isna().sum()

dt             0
loc            0
lat            0
long           0
so2       117565
no2       128616
co        161948
o3        108206
pm10      947434
pm2.5    2228730
dtype: int64

In [533]:
dfpc =dfpc.drop_duplicates()

In [534]:
dfpc.duplicated().sum()

0

In [535]:
dfpc = dfpc.dropna()

In [536]:
dfpc.isna().sum()

dt       0
loc      0
lat      0
long     0
so2      0
no2      0
co       0
o3       0
pm10     0
pm2.5    0
dtype: int64

In [537]:
# there are multiple locations , removing all location except 103 to align the date column with another dataset

dfpc = dfpc[ dfpc['loc'] == 103 ]

In [538]:
dfpc.head(5)

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
1627649,2001-08-08,103,37.540037,127.002661,0.003,0.035,0.2,0.027,54.0,32.0
1627674,2001-08-08,103,37.540037,127.002661,0.003,0.034,0.2,0.024,43.0,21.0
1627699,2001-08-08,103,37.540037,127.002661,0.003,0.028,0.2,0.018,36.0,20.0
1627724,2001-08-08,103,37.540037,127.002661,0.003,0.031,0.3,0.014,38.0,20.0
1627749,2001-08-08,103,37.540037,127.002661,0.004,0.035,0.3,0.013,35.0,16.0

In [539]:
# removing duplicates 
dfpc.drop_duplicates(subset=['dt', 'loc', 'lat', 'long'], keep='first', inplace=True)

In [540]:
dfpc.sort_values(by='dt' , ascending=True ).head(5)

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
1627649,2001-08-08,103,37.540037,127.002661,0.003,0.035,0.2,0.027,54.0,32.0
1627849,2001-08-09,103,37.540037,127.002661,0.004,0.026,0.2,0.014,41.0,18.0
1628448,2001-08-10,103,37.540037,127.002661,0.003,0.039,0.2,0.003,57.0,37.0
1629047,2001-08-11,103,37.540037,127.002661,0.004,0.060,0.3,0.003,70.0,47.0
1629645,2001-08-12,103,37.540037,127.002661,0.003,0.031,0.2,0.007,33.0,15.0

In [541]:
dfpc.sort_values(by='dt' , ascending=False ).head(2)

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
5984185,2021-12-31,103,37.540037,127.002661,0.003,0.009,0.3,0.028,22.0,12.0
5983589,2021-12-30,103,37.540037,127.002661,0.004,0.016,0.4,0.019,37.0,20.0

In [542]:
row_count = len(dfpc)
row_count

7082

In [543]:
dfpc.sort_values(by='dt', ascending=True).head(5)

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
1627649,2001-08-08,103,37.540037,127.002661,0.003,0.035,0.2,0.027,54.0,32.0
1627849,2001-08-09,103,37.540037,127.002661,0.004,0.026,0.2,0.014,41.0,18.0
1628448,2001-08-10,103,37.540037,127.002661,0.003,0.039,0.2,0.003,57.0,37.0
1629047,2001-08-11,103,37.540037,127.002661,0.004,0.060,0.3,0.003,70.0,47.0
1629645,2001-08-12,103,37.540037,127.002661,0.003,0.031,0.2,0.007,33.0,15.0

In [544]:
dfpc = dfpc.groupby( (dfpc['dt']).dt.to_period('M')).first().reset_index(drop=True)
dfpc.head(5)

,dt,loc,lat,long,so2,no2,co,o3,pm10,pm2.5
0,2001-08-08,103,37.540037,127.002661,0.003,0.035,0.2,0.027,54.0,32.0
1,2001-09-12,103,37.540037,127.002661,0.004,0.024,0.2,0.026,65.0,48.0
2,2001-10-01,103,37.540037,127.002661,0.004,0.023,0.3,0.006,18.0,9.0
3,2001-11-01,103,37.540037,127.002661,0.003,0.014,0.3,0.022,33.0,19.0
4,2001-12-01,103,37.540037,127.002661,0.003,0.031,0.3,0.013,33.0,10.0

In [545]:
row_count = len(dfpc)
row_count

243

### **Remove unnecessary variables and combine datasets**

Depending on the datasets, you can also peform the combination before the cleaning steps.

In [546]:
dfwc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10968 entries, 0 to 10971
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              10968 non-null  object
 1   datetime          10968 non-null  datetime64[ns]
 2   tempmax           10968 non-null  float64
 3   tempmin           10968 non-null  float64
 4   temp              10968 non-null  float64
 5   feelslikemax      10968 non-null  float64
 6   feelslikemin      10968 non-null  float64
 7   feelslike         10968 non-null  float64
 8   dew               10968 non-null  float64
 9   humidity          10968 non-null  float64
 10  precip            10968 non-null  float64
 11  precipprob        10968 non-null  int64
 12  precipcover       10968 non-null  float64
 13  windspeed         10968 non-null  float64
 14  winddir           10968 non-null  float64
 15  sealevelpressure  10968 non-null  float64
 16  cloudcover        10968 non-null  float64
 17  visibility        10968 non-null  float64
 18  sunrise           10968 non-null  datetime64[ns]
 19  sunset            10968 non-null  datetime64[ns]
 20  moonphase         10968 non-null  float64
 21  conditions        10968 non-null  object
 22  description       10968 non-null  object
 23  icon              10968 non-null  object
dtypes: datetime64[ns](3), float64(16), int64(1), object(4)
memory usage: 2.1+ MB

In [547]:
#  filtering out columns so that we have only columns that we need in the weather data
dfwc = dfwc[['name' , 'datetime' , 'tempmax' , 'tempmin' , 'temp']] 
dfwc.head(5)

    name   datetime  tempmax  tempmin  temp
0  seoul 1994-01-01     35.2     16.4  26.3
1  seoul 1994-01-02     43.0     31.5  36.2
2  seoul 1994-01-03     47.9     30.9  38.0
3  seoul 1994-01-04     38.8     22.1  30.1
4  seoul 1994-01-05     40.0     24.0  33.1

In [548]:
dfwc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10968 entries, 0 to 10971
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10968 non-null  object
 1   datetime  10968 non-null  datetime64[ns]
 2   tempmax   10968 non-null  float64
 3   tempmin   10968 non-null  float64
 4   temp      10968 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(1)
memory usage: 514.1+ KB

In [549]:
dfwc =dfwc.rename(columns={'datetime':'date'} )
dfwc.head(2)

    name       date  tempmax  tempmin  temp
0  seoul 1994-01-01     35.2     16.4  26.3
1  seoul 1994-01-02     43.0     31.5  36.2

In [550]:
# Sort by date just in case
dfwc = dfwc.sort_values('date', ascending= True)

In [551]:
dfwc = dfwc.groupby(dfwc['date'].dt.to_period('M')).first().reset_index(drop=True)

In [552]:
#
dfwc.head(3)

    name       date  tempmax  tempmin  temp
0  seoul 1994-01-01     35.2     16.4  26.3
1  seoul 1994-02-01     39.2     23.9  32.8
2  seoul 1994-03-01     40.6     20.2  30.0

In [553]:
# We have Air pollution data from 2001-8-8 to 2021-12-31
# Filtering the weather data 

dfwc = dfwc[ ( dfwc['date'].dt.year >= 2001 ) & ( dfwc['date'].dt.year <= 2021 )]
dfwc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 252 entries, 84 to 335
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     252 non-null    object
 1   date     252 non-null    datetime64[ns]
 2   tempmax  252 non-null    float64
 3   tempmin  252 non-null    float64
 4   temp     252 non-null    float64
dtypes: datetime64[ns](1), float64(3), object(1)
memory usage: 11.8+ KB

In [554]:
#  starting date in the weather data 2001-01-01
dfwc.sort_values( by='date', ascending=True).head(2)

     name       date  tempmax  tempmin  temp
84  seoul 2001-01-01     33.9     12.1  22.2
85  seoul 2001-02-01     32.6     12.3  21.8

In [564]:
dfwc = dfwc[dfwc['date'] >= '2001-08-01']

In [555]:
#  last date in the weather data 2021-11-01
dfwc.sort_values( by='date', ascending=False).head(2)

      name       date  tempmax  tempmin  temp
335  seoul 2021-12-01     34.4     27.2  30.4
334  seoul 2021-11-01     61.9     50.8  55.3

In [565]:
row_count= len(dfwc)
print('total rows in weather data =',row_count)

total rows in weather data = 245

In [557]:
row_count= len(dfpc)
print('total rows in Pollution data =',row_count)

total rows in Pollution data = 243

In [558]:
# drop irrelavent columns loc , lat , long
dfpc.drop(columns=['loc', 'lat', 'long'],inplace=True)
dfpc.head(2)

          dt    so2    no2   co     o3  pm10  pm2.5
0 2001-08-08  0.003  0.035  0.2  0.027  54.0   32.0
1 2001-09-12  0.004  0.024  0.2  0.026  65.0   48.0

In [559]:
#  starting date in the pollution data 2001-8-8
dfpc.sort_values( by='dt', ascending=True).head(5)

          dt    so2    no2   co     o3  pm10  pm2.5
0 2001-08-08  0.003  0.035  0.2  0.027  54.0   32.0
1 2001-09-12  0.004  0.024  0.2  0.026  65.0   48.0
2 2001-10-01  0.004  0.023  0.3  0.006  18.0    9.0
3 2001-11-01  0.003  0.014  0.3  0.022  33.0   19.0
4 2001-12-01  0.003  0.031  0.3  0.013  33.0   10.0

In [560]:
# last date in the polution 2021-12-31
dfpc.sort_values( by='dt', ascending=False).head(2)

            dt    so2    no2   co     o3  pm10  pm2.5
242 2021-12-01  0.003  0.007  0.3  0.024  21.0   13.0
241 2021-11-01  0.003  0.041  0.6  0.003  30.0   25.0

## 4. Update your data store
Update your local database/data store with the cleaned data, following best practices for storing your cleaned data:

- Must maintain different instances / versions of data (raw and cleaned data)
- Must name the dataset files informatively
- Ensure both the raw and cleaned data is saved to your database/data store

In [561]:
#FILL IN - saving data

## 5. Answer the research question

### **5.1:** Define and answer the research question 
Going back to the problem statement in step 1, use the cleaned data to answer the question you raised. Produce **at least** two visualizations using the cleaned data and explain how they help you answer the question.

*Research question:* FILL IN from answer to Step 1

In [562]:
#Visual 1 - FILL IN

*Answer to research question:* FILL IN

In [563]:
#Visual 2 - FILL IN

*Answer to research question:* FILL IN

### **5.2:** Reflection
In 2-4 sentences, if you had more time to complete the project, what actions would you take? For example, which data quality and structural issues would you look into further, and what research questions would you further explore?

*Answer:* FILL IN